; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 9 parts and 200% wood
; Machines:
;   2 highspeed-saw
;   2 glazer
;   2 grinder
;   2 immersion-varnisher
;   2 planer
;   2 saw
;   2 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 highspeed-saw1 - highspeed-saw
    glazer0 glazer1 - glazer
    grinder0 grinder1 - grinder
    immersion-varnisher0 immersion-varnisher1 - immersion-varnisher
    planer0 planer1 - planer
    saw0 saw1 - saw
    spray-varnisher0 spray-varnisher1 - spray-varnisher
    green mauve blue black red white - acolour
    oak teak - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 - part
    b0 b1 b2 b3 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (boardsize-successor s8 s9)
    (boardsize-successor s9 s10)
    (empty highspeed-saw0)
    (empty highspeed-saw1)
    (has-colour glazer0 natural)
    (has-colour glazer0 white)
    (has-colour glazer0 green)
    (has-colour glazer0 mauve)
    (has-colour glazer1 natural)
    (has-colour glazer1 white)
    (has-colour glazer1 green)
    (has-colour glazer1 black)
    (has-colour immersion-varnisher0 mauve)
    (has-colour immersion-varnisher0 black)
    (has-colour immersion-varnisher1 natural)
    (has-colour spray-varnisher0 natural)
    (has-colour spray-varnisher0 black)
    (has-colour spray-varnisher1 mauve)
    (available p0)
    (treatment p0 glazed)
    (surface-condition p0 smooth)
    (wood p0 teak)
    (colour p0 mauve)
    (goalsize p0 large)
    (= (spray-varnish-cost p0) 15)
    (= (glaze-cost p0) 20)
    (= (grind-cost p0) 45)
    (= (plane-cost p0) 30)
    (unused p1)
    (goalsize p1 small)
    (= (spray-varnish-cost p1) 5)
    (= (glaze-cost p1) 10)
    (= (grind-cost p1) 15)
    (= (plane-cost p1) 10)
    (unused p2)
    (goalsize p2 small)
    (= (spray-varnish-cost p2) 5)
    (= (glaze-cost p2) 10)
    (= (grind-cost p2) 15)
    (= (plane-cost p2) 10)
    (unused p3)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (available p4)
    (treatment p4 varnished)
    (surface-condition p4 smooth)
    (wood p4 teak)
    (colour p4 black)
    (goalsize p4 large)
    (= (spray-varnish-cost p4) 15)
    (= (glaze-cost p4) 20)
    (= (grind-cost p4) 45)
    (= (plane-cost p4) 30)
    (unused p5)
    (goalsize p5 small)
    (= (spray-varnish-cost p5) 5)
    (= (glaze-cost p5) 10)
    (= (grind-cost p5) 15)
    (= (plane-cost p5) 10)
    (unused p6)
    (goalsize p6 large)
    (= (spray-varnish-cost p6) 15)
    (= (glaze-cost p6) 20)
    (= (grind-cost p6) 45)
    (= (plane-cost p6) 30)
    (unused p7)
    (goalsize p7 small)
    (= (spray-varnish-cost p7) 5)
    (= (glaze-cost p7) 10)
    (= (grind-cost p7) 15)
    (= (plane-cost p7) 10)
    (unused p8)
    (goalsize p8 small)
    (= (spray-varnish-cost p8) 5)
    (= (glaze-cost p8) 10)
    (= (grind-cost p8) 15)
    (= (plane-cost p8) 10)
    (boardsize b0 s10)
    (wood b0 teak)
    (surface-condition b0 smooth)
    (available b0)
    (boardsize b1 s2)
    (wood b1 teak)
    (surface-condition b1 smooth)
    (available b1)
    (boardsize b2 s7)
    (wood b2 oak)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s1)
    (wood b3 oak)
    (surface-condition b3 smooth)
    (available b3)
  )
  (:goal
    (and
    (available p0)
    (colour p0 green)
    (treatment p0 glazed)
    (surface-condition p0 verysmooth)
    (available p1)
    (colour p1 natural)
    (wood p1 teak)
    (surface-condition p1 smooth)
    (available p2)
    (treatment p2 varnished)
    (surface-condition p2 smooth)
    (available p3)
    (colour p3 mauve)
    (wood p3 oak)
    (surface-condition p3 smooth)
    (available p4)
    (colour p4 natural)
    (treatment p4 glazed)
    (available p5)
    (colour p5 black)
    (surface-condition p5 verysmooth)
    (available p6)
    (colour p6 green)
    (treatment p6 glazed)
    (wood p6 teak)
    (surface-condition p6 smooth)
    (available p7)
    (colour p7 white)
    (treatment p7 glazed)
    (wood p7 oak)
    (surface-condition p7 verysmooth)
    (available p8)
    (treatment p8 varnished)
    (wood p8 teak)
    (surface-condition p8 smooth)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b1 p5 saw0 teak smooth s2 s1)
   deleted: (unused p5)
   added: (available p5) (wood p5 teak) (surface-condition p5 smooth) (colour p5 natural) (treatment p5 untreated) (boardsize b1 s1)
   goals met: 4 of 35
2. (do-saw-medium b2 p3 saw0 oak rough s7 s6 s5)
   deleted: (unused p3)
   added: (available p3) (wood p3 oak) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b2 s5)
   goals met: 6 of 35
3. (do-saw-large b0 p6 saw0 teak smooth s10 s8 s9 s7)
   deleted: (unused p6)
   added: (available p6) (wood p6 teak) (surface-condition p6 smooth) (colour p6 natural) (treatment p6 untreated) (boardsize b0 s7)
   goals met: 9 of 35
4. (do-plane p4 planer0 smooth black varnished)
   deleted: (treatment p4 varnished) (colour p4 black)
   added: (treatment p4 untreated) (colour p4 natural)
   goals met: 10 of 35
5. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 11 of 35
6. (do-grind p5 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p5 smooth)
   added: (surface-condition p5 verysmooth)
   goals met: 12 of 35
7. (do-grind p0 grinder0 smooth mauve glazed untreated)
   deleted: (surface-condition p0 smooth) (treatment p0 glazed) (colour p0 mauve)
   added: (surface-condition p0 verysmooth) (treatment p0 untreated) (colour p0 natural)
   goals met: 12 of 35
8. (do-glaze p5 glazer1 black)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 black)
   goals met: 13 of 35
9. (do-glaze p4 glazer0 natural)
   deleted: (treatment p4 untreated)
   added: (treatment p4 glazed)
   goals met: 14 of 35
10. (do-glaze p3 glazer0 mauve)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 mauve)
   goals met: 15 of 35
11. (do-glaze p0 glazer0 green)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 glazed) (colour p0 green)
   goals met: 17 of 35
12. (do-glaze p6 glazer0 green)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 glazed) (colour p6 green)
   goals met: 19 of 35
13. (do-saw-small b0 p1 saw0 teak smooth s7 s6)
   deleted: (unused p1)
   added: (available p1) (wood p1 teak) (surface-condition p1 smooth) (colour p1 natural) (treatment p1 untreated) (boardsize b0 s6)
   goals met: 23 of 35
14. (do-saw-small b0 p2 saw0 teak smooth s6 s5)
   deleted: (unused p2)
   added: (available p2) (wood p2 teak) (surface-condition p2 smooth) (colour p2 natural) (treatment p2 untreated) (boardsize b0 s5)
   goals met: 25 of 35
15. (do-immersion-varnish p2 immersion-varnisher0 black smooth)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 varnished) (colour p2 black)
   goals met: 26 of 35
16. (do-saw-small b0 p8 saw0 teak smooth s5 s4)
   deleted: (unused p8)
   added: (available p8) (wood p8 teak) (surface-condition p8 smooth) (colour p8 natural) (treatment p8 untreated) (boardsize b0 s4)
   goals met: 29 of 35
17. (do-immersion-varnish p8 immersion-varnisher0 black smooth)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 varnished) (colour p8 black)
   goals met: 30 of 35
18. (do-saw-small b3 p7 saw0 oak smooth s1 s0)
   deleted: (unused p7)
   added: (available p7) (wood p7 oak) (surface-condition p7 smooth) (colour p7 natural) (treatment p7 untreated) (boardsize b3 s0)
   goals met: 32 of 35
19. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 33 of 35
20. (do-glaze p7 glazer0 white)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 white)
   goals met: 35 of 35
